224 164
224 176
224 165
32 256
224 177
256 190
101 32
115 32
256 176
97 32
32 257
258 141
110 32
258 135
110 100
261 256
267 256
44 32
260 141
101 114
257 190
256 191
274 257
259 149
256 130
258 128
276 257
108 32
111 32
116 104
257 191
101 110
277 256
97 114
105 110
115 116
111 110
111 114
256 164
121 32
260 129
100 262
269 259
97 110
257 130
114 101
116 105
285 262
97 263
99 105
256 168
270 105
258 139
261 259
111 263
97 108
287 116
101 263
286 257
46 32
100 32
108 265
281 259
101 283
256 149
73 307
261 264
300 257
97 270
267 264
280 259
97 100
97 283
111 109
105 99
256 184
185 258
111 102
101 316
97 116
101 115
101 268
259 184
174 269
324 32
105 116
111 268
279 298
257 164
333 32
117 114
258 164
257 168
257 178
195 179
264 259
226 128
257 176
97 109
258 129
332 136
97 268
115 105
272 175
339 326
290 103
256 174
260 135
260 139
278 176
256 178
101 99
280 256
266 170
108 105
293 32
101 291
101 109
105 268
321 265
256 175
173 322
377 294
282 176
195 173
44 259
114 111
275 32
100 105
264 272
195 161
114 105
97 115
257 149
256 185
115 117
256 170
282 178
259 170
116 284
117 110
361 32
113 117
288 175
288 149
257 166
260 128
297 317
49 57
259 360
99 292
97 305
108 310
352 139
256 166
296 266
271 168
258 130
112 111
272 164
101 108
97 302
44 266
256 181
256 182
116 32
109 105
97 273
117 108
50 48
46 10
347 259
115 262
112 289
99 329
363 257
97 99
97 98
148 351
350 268
279 318
111 108
100 319
285 32
115 273
257 174
286 266
116 114
278 175
105 291
257 181
256 188
195 169
271 156
99 104
84 104
256 151
364 266
118 105
108 304
184 278
108 101
46 409
111 117
289 32
271 178
112 101
281 376
279 309
118 275
276 266
101 120
98 105
99 111
323 166
398 262
105 115
103 114
46 266
259 356
431 182
105 263
97 291
112 275
308 280
105 109
256 167
314 149
260 134
104 32
272 183
257 170
257 161
48 48
259 168
108 295
259 133
173 379
181 288
103 105
321 97
493 344
278 168
103 117
32 258
369 365
451 262
256 161
109 312
260 130
112 371
299 116
256 172
300 266
101 100
301 115
257 159
260 136
111 100
32 40
279 308
109 97
102 293
308 326
271 164
314 168
284 297
259 176
386 263
265 297
98 295
290 99
116 275
312 114
37 32
272 181
257 175
256 163
259 172
350 32
115 101
105 114
108 111
258 136
112 382
336 273
259 156
97 103
115 111
119 105
259 174
282 168
259 164
332 129
353 278
109 117
289 105
345 303
117 99
100 101
108 117
170 325
309 356
99 117
109 524
321 357
112 108
311 313
257 151
407 435
105 270
292 313
195 186
271 174
259 434
294 325
256 156
288 164
271 184
296 349
394 325
348 498
115 315
293 116
105 307
266 184
288 168
97 118
259 378
59 32
406 116
117 268
256 165
347 10
39 263
111 273
422 108
269 420
256 159
101 116
302 99
119 104
286 474
97 316
327 284
259 166
173 271
266 181
105 100
302 292
98 114
112 97
271 166
256 154
282 175
102 114
48 32
396 265
272 159
312 262
320 486
503 447
338 298
401 476
458 32
109 290
266 149
323 154
10 257
98 108
374 303
292 103
119 304
167 258
282 164
337 319
258 131
545 439
288 184
272 166
323 151
76 265
99 342
330 32
101 270
111 115
293 105
518 109
101 273
449 359
135 331
339 280
312 32
100 336
178 453
315 502
97 112
257 167
368 151
271 175
258 166
275 268
116 346
112 114
549 256
279 264
256 150
278 159
195 177
121 273
272 165
393 296
112 117
315 73
104 105
32 340
315 69
266 176
108 289
109 299
417 342
114 341
327 265
259 181
286 470
337 317
109 289
112 301
112 579
335 32
259 185
367 292
271 130
143 320
109 111
291 32
275 262
103 111
425 49
403 375
105 305
115 104
329 32
388 273
256 173
497 619
278 178
389 278
402 532
32 295
265 295
111 99
110 284
104 304
103 104
102 117
472 109
117 100
259 151
256 183
588 309
343 184
611 698
279 269
105 108
417 292
97 121
330 485
356 280
97 107
299 103
58 32
278 181
323 161
286 623
566 117
98 101
103 287
381 156
259 134
456 164
266 174
430 284
380 265
99 262
334 526
117 109
315 65
318 184
260 138
166 476
407 292
110 105
99 424
112 387
597 723
97 117
385 181
279 399
175 258
257 185
257 184
429 265
311 491
49 32
385 174
500 629
320 322
321 423
391 98
109 101
354 468
632 294
133 306
282 130
273 303
340 303
116 117
118 262
97 106
10 10
288 178
263 345
98 117
311 273
425 48
258 140
288 174
378 463
259 494
257 163
310 297
687 329
102 371
97 102
426 10
302 342
621 445
281 306
67 104
301 495
343 172
674 103
341 263
108 262
335 262
527 556
352 147
331 298
271 129
148 264
271 181
314 164
287 305
395 303
101 289
496 590
77 117
119 32
341 117
110 111
109 275
358 100
271 170
32 404
393 411
257 154
372 32
544 305
98 111
479 105
104 265
259 137
259 173
309 184
602 183
456 165
119 293
669 268
586 290
330 265
108 299
119 692
99 301
429 116
259 182
323 650
97 664
327 310
97 290
117 112
112 105
391 108
119 101
98 275
111 440
288 163
306 269
271 165
296 344
323 159
350 110
112 424
110 293
99 108
367 116
311 105
490 298
259 647
259 178
280 571
256 136
385 183
513 348
274 266
409 32
275 342
65 358
289 262
73 270
97 358
443 327
100 346
259 154
296 369
349 453
257 173
607 380
108 284
110 747
291 815
261 343
280 331
259 175
306 309
294 298
338 368
413 392
282 156
767 448
273 340
354 312
291 373
111 112
291 114
404 57
482 400
616 852
475 280
436 184
261 381
308 452
717 854
401 278
505 488
296 389
895 268
108 335
627 32
107 32
116 383
462 305
397 303
112 511
115 346
32 49
582 635
338 269
352 140
486 269
170 264
309 156
264 763
178 364
285 101
592 108
103 299
301 370
108 341
334 374
330 328
465 110
102 275
467 116
41 32
287 262
100 284
325 269
320 298
272 149
548 320
686 308
271 136
306 298
259 660
368 166
279 925
952 571
282 183
575 296
386 110
284 403
32 530
414 858
99 312
109 514
416 295
394 351
272 167
368 167
323 164
313 297
458 10
97 315
287 103
538 119
111 103
290 116
100 554
109 292
102 105
504 32
272 178
256 171
355 331
309 151
338 362
519 360
256 162
320 415
137 577
314 151
703 183
181 314
349 411
517 121
305 435
99 101
302 109
101 118
67 69
341 295
98 367
933 495
478 32
289 295
425 50
311 108
104 433
358 103
508 804
427 378
272 154
271 149
294 415
318 356
277 264
343 178
355 662
271 163
259 806
500 168
296 446
296 257
349 296
311 504
116 912
317 375
391 32
273 319
324 284
114 97
489 32
384 115
275 105
388 115
108 108
354 105
733 275
750 109
101 103
115 342
309 434
271 147
271 183
984 447
355 306
10 256
258 137
278 154
266 156
284 295
507 262
304 297
407 567
69 283
76 310
100 373
329 290
299 115
301 99
301 263
960 346
67 329
404 53
104 445
352 148
166 593
261 427
1040 614
1065 325
279 322
282 174
348 411
314 170
274 924
637 375
422 312
606 262
741 303
118 383
499 543
354 262
102 537
370 342
41 273
104 289
346 98
373 112
56 32
416 367
548 716
164 716
281 294
347 32
281 326
256 549
294 558
256 160
762 755
379 296
1021 262
414 625
568 268
100 310
302 941
354 615
468 275
537 32
384 465
72 731
99 478
99 387
693 937
103 485
554 457
102 330
71 111
654 943
308 366
542 306
413 753
170 351
534 306
355 264
288 143
394 264
564 466
266 133
257 156
300 418
257 172
372 262
118 334
489 612
116 299
766 384
335 334
111 116
290 102
429 302
103 382
454 100
99 529
793 114
117 270
464 184
362 272
385 165
281 381
797 608
314 175
653 483
109 330
672 268
293 313
65 114
110 101
765 835
837 1077
796 292
457 103
67 292
528 677
404 54
100 299
166 903
259 165
167 761
410 964
259 689
981 376
574 306
258 170
258 168
323 929
286 418
282 149
314 178
282 166
551 270
840 262
265 317
833 108
52 55
97 295
341 32
293 100
583 262
289 116
263 340
99 437
49 56
103 301
450 32
97 473
115 284
290 305
1159 642
373 98
391 263
259 143
182 531
272 168
281 320
338 569
298 184
288 182
309 168
175 390
266 746
149 910
266 168
512 663
680 598
636 466
260 131
610 598
529 262
99 678
295 317
83 459
119 372
111 98
121 811
100 367
101 102
1079 691
285 383
115 121
336 315
302 118
115 275
98 262
67 627
1230 511
404 55
275 305
99 327
101 122
392 325
288 181
279 351
271 185
258 629
344 278
379 278
497 704
108 380
448 263
69 268
304 295
82 101
459 263
115 459
859 285
103 290
334 395
370 109
112 299
115 485
52 32
592 341
97 105
749 658
336 917
114 117
101 421
99 289
584 463
259 831
480 516
271 154
294 277
1039 280
951 325
264 400
256 143
343 168
176 449
482 412
133 902
456 181
266 182
282 172
822 1045
363 353
44 871
567 297
289 342
111 443
506 317
659 1193
32 297
111 45
121 265
998 1078
367 104
437 972
1225 898
116 387
102 290
481 311
273 751
116 514
111 473
555 118
32 50
404 56
481 684
272 174
185 922
281 366
368 161
338 888
539 306
734 634
308 617
520 558
271 143
331 415
176 645
314 736
954 663
1319 365
703 149
282 151
348 442
365 402
286 426
314 176
630 704
809 265
565 297
295 319
80 725
1331 445
290 395
105 107
116 119
779 421
375 709
732 337
417 99
527 301
439 1058
1105 115
454 114
104 1184
285 373
109 293
473 324
396 105
49 44
1111 460
105 122
259 135
945 768
385 163
318 434
173 318
185 308
269 326
258 171
294 309
269 662
279 355
343 769
378 405
176 390
909 166
470 598
314 174
278 174
624 701
265 438
312 265
544 1074
1103 708
690 691
342 303
66 970
104 599
115 334
66 713
417 118
105 103
1135 556
388 334
110 117
114 335
118 552
287 99
540 974
391 1190
97 104
311 1192
110 742
112 293
114 265
53 32
398 105
172 617
320 277
415 412
338 666
271 151
281 419
461 376
272 170
271 172
331 666
133 392
829 318
385 164
927 1314
656 656
306 635
338 928
266 154
257 832
286 369
44 369
444 446
150 444
441 869
266 173
274 418
260 140
966 365
266 134
581 323
483 442
278 170
430 1233
672 283
506 319
310 403
473 357
101 462
1179 100
116 263
32 345
291 335
301 108
114 424
790 916
517 106
934 275
329 262
877 105
311 336
299 421
1390 304
440 340
262 345
50 32
354 112
1346 262
49 55
99 299
327 313
51 32
98 301
360 184
343 170
137 1010
475 427
320 318
261 589
410 412
294 359
368 172
950 134
1013 1121
819 415
362 1014
719 1271
558 427
601 593
891 724
390 366
256 129
281 279
523 645
146 389
441 296
344 353
991 371
304 471
604 284
114 380
1288 112
407 857
328 297
469 396
1217 439
798 823
566 1435
104 117
315 451
373 275
346 111
1380 100
116 265
315 68
265 102
773 301
1335 284
313 345
262 340
432 116
382 117
592 1080
111 1076
285 459
111 346
69 110
825 439
432 104
98 595
48 44
115 367
263 374
562 432
65 32
112 287
1035 262
1523 793
85 110
100 383
281 392
261 347
362 412
166 308
480 464
175 355
413 264
258 173
494 167
174 745
282 184
1241 164
282 159
894 444
266 164
883 263
428 406
265 319
310 295
877 696
100 448
477 303
287 740
1250 285
315 83
370 102
66 996
69 109
372 433
873 265
290 528
578 502
387 302
299 263
726 313
961 657
373 312
285 685
1446 605
1158 886
642 1252
111 270
849 337
802 100
1083 299
586 382
99 752
114 330
395 1229
1109 977
102 437
721 328
406 886
72 1298
1580 722
68 336
299 302
384 291
32 803
420 1008
1586 783
634 1400
170 1117
546 390
539 366
259 1164
281 427
405 184
482 359
168 298
281 264
359 419
320 351
1043 378
269 594
281 331
679 868
390 264
343 174
308 320
480 436
172 1092
269 366
257 736
348 363
282 163
266 166
184 323
575 411
296 577
680 286
369 353
349 364
142 577
257 179
327 522
883 115
386 268
525 455
711 262
507 313
1098 565
312 313
265 408
97 10
122 265
403 496
711 275
327 304
414 1244
668 625
289 101
404 1180
459 270
795 290
78 101
265 109
292 336
117 263
1498 462
334 303
104 275
285 477
66 1559
292 45
358 291
510 275
49 46
1137 119
290 101
117 115
116 116
562 262
426 502
104 111
111 119
1191 330
1663 424
290 118
287 115
860 1031
111 428
327 1140
930 1104
311 283
421 345
538 99
299 99
289 109
100 117
1231 263
114 346
299 305
530 345
100 275
104 357
110 1350
115 330
289 382
1235 32
264 645
1114 572
420 399
1009 1588
136 331
523 390
523 449
137 306
182 1168
294 261
464 557
531 294
272 185
156 306
410 359
405 378
413 362
980 322
1268 794
410 593
269 294
168 277
520 277
281 609
258 172
271 167
322 318
1067 533
523 1066
1535 412
166 420
1042 807
1419 1416
509 149
276 418
185 680
955 418
909 167
389 411
521 498
365 441
484 729
1242 151
673 513
469 291
409 705
358 898
687 350
813 307
458 776
540 847
1636 596
386 596
414 1526
802 121
640 284
527 262
707 114
97 285
1218 657
718 303
391 112
670 32
813 710
659 329
345 375
1060 48
112 383
121 10
34 32
108 316
105 273
675 295
275 265
1516 1569
315 67
633 303
116 101
111 107
50 54
433 800
116 334
335 346
443 1055
115 109
99 336
416 101
384 1056
80 382
472 108
73 73
53 273
66 74
1779 80
1034 328
102 1033
99 677
256 134
170 1690
309 165
325 645
264 318
1598 1407
661 1313
399 805
343 181
385 156
602 151
492 306
172 965
172 306
531 322
390 1091
475 589
785 1198
322 614
490 359
348 282
832 547
770 344
266 137
667 418
257 183
154 484
653 547
442 149
133 344
1148 379
649 297
591 319
580 265
1734 1149
839 305
580 310
884 471
551 450
403 764
284 438
98 775
1547 1234
333 102
1436 590
100 1054
1251 657
414 370
596 328
109 341
68 416
537 262
396 106
1836 433
788 639
103 357
422 100
327 105
287 105
115 917
287 302
710 421
111 316
77 111
414 119
115 292
358 292
289 273
101 384
335 114
313 340
115 437
605 263
71 324
301 919
112 346
116 382
100 330
49 273
57 32
85 748
1782 370
696 328
80 289
111 305
133 1688
632 715
368 150
405 174
264 508
1310 1353
362 376
539 1466
660 136
320 461
259 646
461 318
1698 866
318 724
166 399
362 1015
308 715
280 294
279 867
259 152
176 893
413 306
184 298
279 325
362 866
343 1717
1894 320
1803 655
37 41
487 623
501 1806
808 365
1174 702
487 365
653 444
550 181
456 149
314 181
442 133
323 172
282 181
1212 344
402 418
484 349
112 568
1913 625
310 438
638 319
110 579
386 32
712 284
878 1048
956 330
1343 302
535 337
118 284
108 897
116 310
297 408
106 275
510 599
105 499
885 328
428 287
1932 559
1933 529
315 1052
315 637
991 293
337 455
568 108
681 375
430 396
1637 639
115 1743
108 324
1497 103
66 295
875 1290
467 684
73 268
108 627
80 1837
1650 1256
732 1839
111 915
454 437
299 740
424 302
959 676
301 316
196 129
496 10
336 262
1083 357
97 374
798 262
273 265
301 103
652 104
104 354
1061 642
1522 290
1228 118
383 345
102 916
302 774
291 330
354 914
117 106
1377 311
469 346
117 116
50 46
109 510
406 443
105 118
683 818
275 114
533 1687
533 272
531 1527
904 427
280 320
271 161
889 390
355 392
1201 1787
184 415
892 152
985 277
1701 907
269 419
523 893
769 359
534 1092
385 151
546 412
576 1706
761 1015
256 155
797 1710
519 1596
272 184
609 1008
343 154
1707 768
156 520
269 306
1311 359
185 461
343 557
133 366
347 1095
1144 400
1044 1114
2024 331
376 907
258 169
381 378
820 54
80 73
501 1898
257 182
988 314
2033 163
282 167
278 161
156 353
348 296
501 1811
402 344
547 1428
1127 488
1207 466
483 603
1096 474
379 663
372 1918
305 713
104 731
560 1347
448 114
100 599
69 291
479 284
641 620
862 122
358 435
373 615
1939 994
337 408
834 303
65 270
73 115
285 357
53 53
1220 263
559 112
327 117
287 748
83 1055
97 119
824 328
67 529
1750 328
262 553
110 1294
101 45
99 311
429 370
669 421
99 652
1340 1384
85 83
2083 36
50 44
1511 1110
555 1297
792 345
99 346
304 265
49 51
430 112
104 742
878 397
116 337
291 121
71 1561
469 270
468 114
103 101
87 372
99 293
101 295
1302 416
457 327
848 1131
341 334
1141 383
816 421
481 826
406 818
301 643
1577 971
291 387
87 293
2115 1757
111 479
585 303
1086 605
122 292
107 104
194 176
37 273
116 287
115 10
74 299
115 115
367 117
336 10
73 110
115 861
694 49
49 52
79 387
117 98
902 322
264 533
1006 1398
1871 359
646 944
178 452
413 1354
519 1118
182 294
879 366
288 159
258 174
661 853
134 482
269 715
1884 355
271 159
1363 1704
173 1703
489 48
166 1361
306 261
734 308
480 908
355 366
405 168
542 520
1240 755
1276 1893
589 256
1014 359
1067 359
572 1709
1804 173
501 1125
1321 1018
393 881
137 1367
1722 505
911 296
286 323
353 444
402 348
344 728
353 786
509 181
487 1429
882 855
2183 728
266 151
135 1483
453 1207
730 521
770 564
624 156
174 1729
560 297
438 1176
563 295
422 529
1005 884
668 372
273 317
788 739
76 304
604 599
105 384
110 568
2203 817
2204 522
423 319
111 578
101 305
479 380
2209 514
506 408
287 122
843 310
101 106
551 848
752 504
1035 383
958 297
477 265
1491 443
1053 1744
121 315
289 313
275 263
108 327
101 478
299 107
384 118
2062 354
913 383
721 273
297 303
931 2069
2233 742
2070 107
2235 677
69 1646
32 374
467 445
1107 262
77 97
100 329
1554 112
417 774
510 554
110 1651
293 997
285 1508
1339 32
2079 897
51 54
468 108
114 801
49 54
685 303
313 874
109 311
65 99
665 303
335 962
108 287
462 111
66 1082
109 287
397 395
459 421
111 370
103 289
1570 397
116 273
1153 814
49 53
878 918
106 117
114 292
98 432
1301 1968
114 287
102 108
511 112
1572 283
1664 658
116 373
315 84
961 275
275 101
119 289
682 107
82 775
433 108
99 1262
77 299
543 262
98 416
1393 98
51 48
334 265
370 850
109 507
32 55
51 44
66 105
275 334
100 265
102 1653
83 433
2131 371
586 387
2308 779
595 552
714 1988
288 170
1989 161
601 903
475 1007
494 1198
264 45
294 1011
259 1691
294 1405
174 1876
2144 1406
2322 635
325 2146
309 360
410 366
256 602
601 308
1120 355
44 338
279 362
368 926
135 306
405 170
546 777
492 700
181 400
889 355
534 1041
415 355
953 463
688 331
666 412
147 351
719 1714
137 392
2015 531
602 136
298 724
1013 399
1413 325
134 2023
413 331
279 2025
2014 1718
48 1895
1116 2168
484 1366
300 474
581 441
1019 1420
166 2034
1147 466
550 170
135 401
314 159
911 364
363 401
266 178
532 521
501 2184
1905 1910
630 365
484 757
2046 402
314 182
401 610
931 1284
556 103
2379 460
1917 262
386 440
1154 615
2195 1485
1543 1922
372 844
885 311
315 1072
103 1099
273 471
1004 108
1488 563
1286 310
305 292
1245 297
992 297
649 1685
1138 265
118 1686
430 2212
535 317
1385 995
471 317
2215 675
265 443
693 1374
606 341
2407 1921
1113 1374
620 1051
458 409
67 899
2412 265
118 287
1494 270
290 810
454 370
425 612
110 361
1499 104
108 290
293 932
1108 112
291 105
813 115
2425 1254
301 848
2427 116
833 107
83 1334
1187 292
101 1382
743 32
111 1224
1332 299
2248 1110
1443 371
295 340
1258 1001
668 116
98 388
2262 1659
101 112
496 426
1154 312
45 100
375 340
330 759
849 465
358 108
789 303
826 1846
676 345
102 1640
517 290
115 1445
1667 936
262 374
289 110
1848 383
99 313
295 345
109 265
382 99
107 720
372 114
116 97
118 311
358 118
406 1652
2104 899
748 1112
115 450
101 302
98 328
597 284
414 291
287 275
391 109
116 301
1774 116
1678 328
312 328
112 336
104 335
32 52
939 301
52 50
112 936
2111 275
1524 383
1781 2119
1109 504
528 110
1858 312
469 1765
694 760
99 287
517 1345
372 105
490 569
1197 1689
828 392
331 2139
392 461
405 172
447 318
1143 173
306 1089
279 461
331 318
256 131
686 922
368 156
2324 1203
176 1066
1115 306
542 634
714 376
1699 1358
679 359
279 261
259 171
264 281
288 183
308 390
269 320
264 893
320 309
405 557
288 185
700 452
1708 2008
279 277
492 392
1362 2009
174 412
950 136
1362 366
362 777
892 1796
44 279
415 325
413 366
519 1891
490 1799
170 1477
1266 1270
1532 985
308 392
412 269
269 616
2164 318
410 331
2554 359
589 10
156 366
475 347
368 159
294 1203
258 175
449 392
1094 508
362 294
965 306
261 464
271 150
32 45
256 339
1044 366
889 261
286 46
550 163
673 1320
363 470
987 466
266 172
314 185
135 729
442 184
314 167
622 393
296 487
1617 315
2037 987
364 353
1810 470
168 1326
282 185
314 650
1018 630
986 1213
487 411
282 154
266 497
282 170
581 882
667 10
501 344
314 179
1422 954
446 1612
2602 466
1324 488
1623 313
1053 2382
607 664
2196 88
313 317
2050 262
1819 1073
1195 289
2612 103
262 297
384 284
448 934
2202 329
115 380
304 438
104 432
423 317
711 872
327 1151
1937 380
920 32
536 499
414 99
2261 499
693 850
2629 110
305 100
860 386
115 836
1546 292
265 455
99 767
2405 583
301 305
305 567
706 319
284 695
758 317
443 262
631 1176
422 373
2645 606
1101 317
388 525
1487 398
45 1493
108 340
387 32
97 426
1495 675
108 334
118 397
285 537
2234 32
289 450
384 102
811 491
1106 712
1831 1832
1501 346
341 367
119 329
100 800
1155 262
2243 1835
414 115
311 472
999 292
644 340
1059 1255
116 1293
116 111
445 32
373 648
1443 2247
109 1957
108 361
2252 1080
110 1054
290 643
860 388
388 104
457 118
1512 32
1004 341
99 1183
1061 293
119 416
526 303
2093 357
305 302
102 101
335 117
710 116
299 481
115 462
263 838
397 265
354 720
439 340
119 111
262 626
440 303
77 1391
2449 273
1139 328
105 313
97 297
2092 457
1033 283
459 115
1005 2472
743 108
289 302
83 104
1971 848
2720 460
361 273
302 108
305 328
109 335
536 465
450 726
731 2114
118 330
1639 273
80 913
120 481
68 367
71 2485
352 178
2487 109
263 395
52 54
1383 1388
1860 2489
46 55
315 375
65 109
263 874
285 301
97 122
116 367
335 265
1780 32
1642 104
2750 1262
1524 275
1160 1778
1857 1749
1228 1129
116 293
711 270
846 32
1002 50
116 1134
372 481
398 101
275 311
1161 740
32 87
2765 1334
2136 400
399 261
1142 2138
593 399
830 298
281 362
783 1404
309 1589
660 143
1197 419
322 2508
601 399
318 647
281 343
754 1064
1120 413
494 173
754 1167
820 53
172 1041
32 36
413 609
400 1204
2789 288
492 331
2002 618
318 360
32 34
1312 256
1042 400
1315 1478
133 419
1889 405
905 1006
480 343
576 763
362 306
298 557
1530 306
164 320
420 574
1352 306
490 269
166 1798
436 2344
338 390
279 281
338 320
318 168
32 381
45 331
805 1399
394 978
2819 1601
1017 1412
318 170
1274 2347
2563 2565
519 647
381 434
269 362
2013 1896
2828 1404
308 419
588 399
2831 322
2569 1272
492 1873
389 880
1536 401
2575 365
142 2171
547 498
1538 353
296 348
986 610
278 166
431 184
314 154
1610 855
550 164
673 1540
314 183
393 1069
296 1123
667 1370
314 166
369 1282
296 418
737 344
137 856
296 488
505 487
431 175
176 1728
296 564
701 842
286 501
143 2364
278 650
550 167
442 174
1424 389
894 389
2870 704
401 598
2189 365
2873 2374
369 2375
484 1020
296 1908
624 497
624 1243
313 319
559 328
111 1128
329 98
1494 307
2030 66
522 408
536 2389
638 613
284 319
1583 499
380 357
552 284
750 817
406 1868
1453 370
435 297
108 837
2897 346
104 407
1434 1177
265 587
335 284
313 295
1634 122
1826 525
265 695
638 317
78 747
1084 457
312 310
1036 1099
460 297
99 527
99 386
471 428
1301 386
116 2648
37 1081
2649 1263
83 101
669 1437
2066 543
108 914
875 1645
387 1076
473 2068
2237 357
454 384
1028 1553
74 845
544 370
721 263
2241 346
2666 337
764 303
999 1249
930 1000
469 478
749 1503
110 334
2431 105
973 382
690 118
2250 1001
101 285
1189 814
2081 341
1444 432
1340 388
914 303
115 397
1342 997
414 116
101 119
115 791
1513 103
2956 370
100 1030
585 340
536 1658
1341 295
290 105
1518 1568
335 313
263 40
98 289
41 671
423 340
291 101
562 299
437 100
382 115
994 313
976 334
98 1384
265 340
993 112
1573 1379
536 398
105 32
78 284
605 328
311 116
930 295
110 329
1261 759
109 324
607 973
115 341
327 118
1113 937
289 99
743 1974
1157 1776
336 727
108 121
429 421
2731 101
540 2732
119 299
275 273
900 554
835 117
1679 648
304 303
51 53
52 44
640 373
100 287
555 305
302 283
52 273
54 273
1232 49
98 514
1525 2107
68 373
65 108
80 301
65 2127
115 112
467 99
104 101
83 116
625 262
1834 670
709 1338
1655 439
824 311
79 114
3030 932
3031 1351
901 49
72 580
428 301
540 1394
112 335
682 387
104 299
289 421
115 749
3041 112
2499 1339
115 290
551 115
2276 915
97 454
876 32
337 115
118 1036
101 98
390 608
1870 614
1116 2504
1462 351
1401 573
185 2773
394 753
1200 2137
782 264
1997 768
381 175
281 280
174 1595
1039 326
905 666
1091 2323
405 689
288 150
167 1597
1144 419
3071 1789
2327 181
338 1881
734 582
735 376
294 318
576 1472
1238 1883
181 608
1885 533
272 163
338 277
490 410
368 182
576 1705
271 182
368 185
410 277
632 1165
256 660
294 362
151 355
661 890
950 143
617 308
134 452
1064 646
308 594
174 777
582 2340
1712 400
412 298
594 306
2807 573
982 449
256 360
436 166
1239 264
1476 427
261 436
356 427
1146 584
267 352
3114 141
688 482
259 161
368 1716
982 376
2019 2818
320 269
500 171
419 655
542 308
138 1478
3125 609
390 1993
279 390
1608 294
753 308
178 1606
865 1606
892 1716
394 1802
338 461
281 516
576 1471
2505 400
331 700
288 156
719 2351
390 322
2154 2790
3143 2348
492 2833
318 161
512 702
266 1278
603 1719
550 178
401 365
441 411
401 379
282 150
1318 547
636 702
393 344
353 2578
3158 1366
2175 856
323 149
1613 728
418 184
1280 2843
172 365
257 456
323 170
484 348
509 154
274 622
181 1281
135 446
2182 512
737 1903
266 1805
353 2591
603 1281
296 441
46 369
1096 426
488 2036
1620 453
1171 348
282 736
3184 365
133 1814
364 550
389 1727
257 165
636 276
296 470
176 1320
487 344
444 1148
521 1368
636 393
636 2040
426 1125
3198 1327
402 59
333 696
1914 836
2383 580
1047 319
1286 304
738 319
108 1157
2134 312
372 117
1733 525
114 386
748 118
551 1928
612 530
524 297
432 773
649 1930
958 403
102 836
358 499
311 380
758 319
111 968
302 1987
525 408
302 370
2618 109
559 1372
969 67
1191 380
591 317
678 337
304 560
289 398
350 103
273 408
299 122
699 408
535 265
535 587
706 317
299 310
327 371
372 1622
312 2058
1867 1925
2627 284
103 396
1969 606
1513 2643
433 775
2120 304
83 2911
275 1395
97 620
109 568
428 827
1773 495
2913 284
2217 1140
2306 827
563 297
73 78
3263 67
620 1246
479 1849
1520 265
357 319
98 641
931 1644
1179 316
66 726
3272 2225
121 299
109 460
83 2652
3276 76
3277 2227
77 311
1154 648
707 2067
275 440
796 342
1552 262
263 553
67 105
315 1946
643 1438
104 121
315 812
313 838
2420 712
406 2931
3293 100
71 846
1554 847
285 692
346 472
396 116
732 370
107 361
2063 108
3302 354
293 111
1550 657
2426 32
2073 328
562 845
1834 1749
86 105
839 1133
341 262
1106 32
2430 104
102 421
69 1000
3316 375
3317 2674
788 295
119 268
1188 53
321 1560
2675 2076
105 555
1292 303
102 1507
422 473
430 1255
330 273
1002 51
1649 994
395 2084
52 37
998 1445
291 801
670 1110
1029 2440
2686 422
114 32
414 108
1748 684
861 334
2957 1256
118 313
346 1224
65 110
80 275
3347 358
2226 657
540 118
387 465
528 109
111 396
652 112
78 293
959 460
1341 665
545 100
111 450
811 370
263 371
1847 104
432 528
116 262
2096 108
976 499
1662 110
32 303
658 262
263 303
518 372
538 121
1665 437
334 340
424 316
225 185
1028 996
472 676
115 432
66 1027
3380 104
374 496
873 423
265 40
816 116
116 939
354 32
108 460
541 303
1953 395
1444 1769
301 118
2280 367
97 465
102 289
1156 328
597 1668
1565 328
697 111
101 465
2285 110
329 101
1499 1061
396 341
285 2286
391 826
1673 328
1345 32
1449 303
440 772
108 433
430 817
540 1772
301 100
553 561
1510 303
299 110
708 1950
3418 383
517 297
104 459
78 1578
555 462
578 451
2295 1973
607 121
104 416
538 814
536 429
315 1337
2997 553
357 2998
391 479
102 102
265 118
345 751
469 311
2101 657
802 2232
100 1027
111 358
414 358
55 44
50 1085
1348 342
99 1254
562 722
540 454
374 375
333 2095
109 354
55 46
52 48
423 371
1299 477
110 1578
101 105
840 295
2126 2748
119 460
1221 674
354 101
2432 268
2757 897
467 2128
1986 312
77 290
479 675
50 1396
370 103
2102 384
781 56
70 114
71 68
3474 80
48 273
99 290
437 117
1259 273
58 776
1827 1866
105 370
284 40
46 46
101 1397
825 283
3045 639
327 373
114 354
80 114
112 507
361 108
3050 2310
1152 450
979 447
2769 309
508 1399
170 1587
133 979
135 1309
355 410
405 784
2319 2774
355 320
326 156
2509 400
654 309
1995 415
785 3061
264 309
769 415
294 2512
3066 819
181 461
744 362
452 325
1874 277
464 494
516 259
1408 306
308 482
269 572
2000 400
182 2150
271 171
1122 2151
523 662
494 3080
381 172
181 868
181 1354
546 306
569 618
261 32
1410 1529
828 1010
1363 415
294 2531
3538 574
325 1200
1093 347
394 1117
1093 427
582 1199
2320 608
436 182
2805 519
261 1238
366 452
1316 325
331 531
688 503
351 1118
819 322
805 609
172 608
376 574
279 1870
178 907
601 1798
368 152
1533 2550
3562 463
308 264
269 280
279 569
979 366
688 1269
261 516
256 147
399 480
1413 2517
338 415
143 419
1715 463
1143 172
688 294
410 322
256 831
273 2163
571 400
2165 378
3096 2511
258 167
271 135
2337 574
3123 355
392 264
618 1277
1882 427
308 1041
309 557
281 41
1585 515
139 294
3595 355
782 331
492 1236
546 308
2355 983
2516 463
1144 306
714 2824
572 264
546 2166
3105 2007
359 362
272 160
143 1689
820 56
338 2018
2338 1165
820 57
399 412
865 2567
576 2560
3616 294
492 362
3146 2570
264 1200
785 1063
32 37
701 300
149 349
393 348
550 165
1481 512
402 353
257 150
1422 1322
314 156
756 3153
282 179
349 702
257 171
418 174
701 509
151 349
402 487
2176 167
353 483
296 474
172 756
989 167
444 509
501 2846
149 745
168 296
729 442
3165 2366
2367 446
513 512
266 650
344 1425
484 512
442 2587
3173 483
363 348
181 349
745 401
1070 730
1209 786
1126 149
441 1019
3664 150
389 393
296 353
162 1901
402 581
1171 1323
1046 348
446 353
173 1726
282 161
389 379
1124 1814
1071 757
1813 3194
314 184
3187 159
484 1127
296 512
2169 466
564 353
1280 1175
296 10
673 2603
176 513
1730 990
349 728
168 488
622 2604
300 58
1062 32
104 580
2135 330
507 541
843 284
458 871
1214 408
59 871
743 2606
106 845
1342 304
304 403
1059 2607
454 1073
1194 1433
429 1925
265 337
116 2051
3711 621
358 268
361 511
195 188
194 171
194 187
760 530
1735 328
551 295
2617 304
885 563
956 115
3723 1783
380 1631
1387 310
333 1866
117 3226
1771 284
372 335
471 319
1387 304
372 600
1283 319
843 851
1033 312
672 291
2210 284
796 567
699 455
2899 1544
290 310
437 3235
3743 330
380 304
1555 457
388 315
73 109
3748 826
3749 284
1914 330
707 2631
2477 1030
857 273
538 473
600 1432
2397 1032
2628 304
372 265
115 311
380 1976
312 292
2637 2395
846 310
1215 2399
3765 560
1389 1926
1329 408
374 2613
678 506
2908 328
3249 396
443 3251
305 1284
327 1102
1489 273
620 637
551 307
1986 615
843 641
2914 682
644 319
104 478
2059 310
116 1057
1293 310
336 620
41 705
395 297
97 398
310 408
640 448
1735 1490
3270 426
2220 295
324 273
273 772
1377 328
273 1182
1332 357
273 375
78 330
3802 1219
97 720
875 1644
3805 105
77 514
611 836
1130 2922
670 710
1945 334
49 2418
1056 1183
562 507
2930 712
387 428
397 345
472 334
3301 2242
115 2423
1217 2937
1949 303
3304 478
1555 370
3824 697
312 491
111 465
424 1131
115 690
1132 995
430 2670
467 1255
457 3315
2665 658
467 112
2941 328
2942 974
682 295
1257 2682
290 430
2948 295
46 54
633 357
1840 2667
116 295
311 341
75 3338
1840 45
102 432
97 1104
545 108
540 116
116 121
397 810
395 265
71 301
3296 301
2263 335
93 32
295 772
2089 114
1106 291
3358 962
3360 823
107 816
299 1298
99 335
1496 1962
289 1640
3362 287
3870 106
3871 1290
289 591
2697 1057
2699 328
454 1032
293 328
86 510
1296 98
335 397
101 1000
440 371
1084 3372
1661 2709
99 1003
2660 938
2098 554
1003 665
358 774
98 387
1336 1392
971 397
765 2979
2466 554
977 345
2467 120
1189 335
115 416
84 2714
80 324
121 304
424 460
1260 328
517 107
336 651
1393 850
397 374
426 65
49 48
583 311
416 341
2718 291
659 432
3913 596
467 919
373 479
290 262
1967 424
116 467
541 340
101 585
54 53
102 3345
432 1772
1575 303
414 973
2096 800
98 324
1502 101
499 289
104 311
32 553
3423 270
102 111
731 900
1454 2064
1857 670
263 789
119 342
2729 116
3940 642
305 112
1579 792
733 305
1573 115
115 683
816 814
71 726
301 2455
920 454
1455 32
53 44
725 697
52 51
336 585
263 265
544 342
46 48
530 340
1983 330
3960 290
999 641
375 718
46 56
107 2103
640 726
112 104
289 100
518 262
504 263
511 275
2751 32
3427 316
396 3011
2126 117
3975 1001
733 99
469 862
578 1949
115 361
643 2297
467 2494
552 32
85 80
121 651
54 32
430 109
2305 328
76 1954
2289 1291
3464 328
3465 1975
428 345
3467 445
275 115
99 433
74 117
1980 116
2753 3014
99 538
327 384
78 1350
305 2417
301 900
103 538
901 760
2288 1263
50 52
628 303
2760 328
781 55
50 49
109 432
100 372
694 50
108 1000
2498 391
99 1453
3034 32
380 32
75 2763
51 612
430 975
110 335
2705 514
99 46
4026 352
4027 137
118 265
328 100
122 32
1161 99
1161 993
384 697
833 268
462 116
302 469
119 97
3493 299
398 644
97 585
103 437
1258 289
375 3494
87 722
4045 3046
4046 77
4047 1515
1852 265
2314 2502
666 573
362 3052
4052 1990
3053 277
154 794
688 452
269 410
782 1165
306 1199
269 331
572 306
261 1090
343 1162
980 978
4064 783
777 978
366 415
4067 306
4068 294
679 3067
156 376
452 264
2514 1406
269 45
1997 322
492 3072
841 1168
762 174
298 689
318 134
2148 1697
820 1180
2149 322
320 264
32 2132
714 867
2329 1784
4087 294
1009 486
4089 264
782 3523
494 164
279 1593
654 1089
520 1306
558 347
557 1472
654 366
542 582
1121 714
4100 1273
381 164
609 366
2004 294
394 1477
1795 359
419 868
156 412
392 2142
3091 129
4110 609
272 158
419 420
338 531
355 715
2336 318
331 573
1303 54
539 804
182 1604
2783 3544
355 617
281 953
464 168
1401 412
155 1313
385 182
1122 2332
1275 3506
343 2799
137 700
634 2012
279 3101
464 2533
281 45
420 1168
385 167
1167 1465
983 184
331 944
1462 264
309 1365
516 867
436 164
298 151
679 1789
394 1533
151 867
2149 2796
436 134
951 1012
399 294
381 174
2017 887
170 539
347 338
259 1794
355 1410
4158 452
171 325
166 325
661 949
574 415
534 366
318 2016
655 320
185 318
449 400
981 3116
269 503
352 152
762 171
482 322
1012 392
4174 2552
294 688
4176 3581
719 419
4178 366
1095 173
256 157
1785 908
338 2555
926 2151
338 1006
2557 3587
475 3124
3499 3540
475 570
1011 427
390 805
655 1411
168 419
259 150
318 1088
904 347
288 1796
436 356
2162 2349
41 59
259 3596
879 322
351 434
762 166
3598 1591
331 1890
164 2540
570 1317
480 2010
1310 410
3134 399
359 608
515 320
298 784
1017 656
1240 170
888 410
306 539
4218 294
4219 400
768 359
928 1119
410 306
309 647
1712 3607
174 866
3130 2829
1475 2159
308 294
2021 807
523 616
2336 3614
2525 3608
1311 400
686 2832
264 390
2834 3618
281 979
281 503
390 922
281 533
2544 359
2571 500
1355 1869
1315 326
1307 318
582 2827
2335 399
4248 306
402 2573
1278 1068
1206 300
487 393
581 1068
703 164
393 453
402 512
1482 3151
137 729
441 575
2839 442
133 1611
137 2840
266 2174
154 869
296 1209
278 149
174 344
989 3644
603 1279
4270 344
4271 3164
274 369
630 1425
2585 521
988 353
702 1069
1536 1538
418 149
550 183
470 521
353 1900
2594 2178
282 182
1241 184
364 349
550 151
393 2866
278 164
770 488
1019 183
349 344
133 2370
278 184
296 401
1809 663
509 184
2853 278
4298 167
3157 2187
164 348
441 1425
2588 728
4303 756
444 610
353 1320
1724 344
2599 1070
300 369
630 1909
4310 2180
501 3665
1046 1280
4313 808
622 745
156 1327
32 56
955 515
989 736
441 2600
369 2358
172 484
10 446
184 2869
4324 2177
2035 730
1730 3690
3691 3661
603 856
411 2191
2190 1327
83 117
102 696
97 968
284 328
920 273
372 101
99 275
1347 313
851 319
600 506
1484 1177
2049 1919
1625 321
4344 304
4345 3208
86 1777
3209 1924
690 3707
265 506
2386 295
528 99
4352 1760
2610 2193
396 1625
3211 112
738 408
455 3213
620 65
2681 3715
311 850
4361 103
337 587
422 302
2299 287
112 388
293 967
528 105
613 1434
114 1372
1934 265
563 337
104 481
861 310
1500 301
566 111
631 1542
2053 327
825 408
422 3729
3730 1645
1196 1737
98 437
1931 40
568 110
580 111
1004 2891
2620 262
311 481
2048 1457
299 380
552 265
111 2067
111 1150
1546 567
448 1861
664 310
1305 1627
787 408
961 416
824 563
758 408
290 696
354 98
3746 305
1004 739
2110 284
293 265
1131 395
779 1584
3391 265
535 319
529 957
1005 408
106 284
1669 565
1733 265
435 438
423 471
448 596
818 284
2402 304
2048 327
311 541
1285 265
559 1026
2098 1978
104 2883
649 668
1488 1097
373 919
101 1646
1177 403
284 471
758 587
311 3248
1246 455
1742 319
1032 354
773 1924
607 112
4441 319
83 3769
2484 2912
116 640
2411 10
3258 942
2128 1227
1136 942
299 1632
2470 262
372 327
1941 2201
2644 111
1136 1100
3437 696
559 1853
473 3764
302 287
2904 304
1934 3268
2218 1300
3792 1149
1261 313
2611 284
100 350
4466 674
600 1287
2647 1484
2632 1684
3256 2633
555 684
67 2919
1373 2444
1248 1942
1492 873
1152 433
357 2920
328 340
77 3274
1944 263
561 3280
65 3808
2065 44
101 1104
683 1829
682 1252
2924 86
4488 311
4489 457
4490 295
2657 316
2658 1553
273 357
68 1027
4495 2928
4496 357
334 626
52 2929
545 285
1648 510
4501 341
2933 1291
3295 1500
2664 397
1185 273
119 677
459 450
433 720
4509 997
2424 299
3823 387
334 342
313 718
106 722
299 543
289 265
1951 273
290 886
358 342
265 114
71 114
3318 295
1333 265
108 665
2245 676
2676 1954
110 721
2943 2678
334 789
1441 101
1829 105
3328 105
301 1942
1753 273
2944 1295
760 1509
299 1385
1655 397
1495 98
301 974
110 1111
849 652
633 799
743 109
766 103
102 2688
1565 759
334 633
2690 3854
445 639
3856 101
3346 305
4553 648
273 371
939 287
2692 108
3352 32
66 104
1657 935
397 553
117 1379
1511 1845
939 1448
284 115
2963 32
596 32
1342 341
72 111
3865 3320
433 2266
457 121
50 53
2695 313
3872 100
4575 3873
450 289
2696 3874
536 311
1057 340
543 313
265 2271
112 478
388 824
2700 725
1951 32
597 337
583 397
98 382
121 357
69 105
116 416
1967 445
3885 334
936 340
2975 1376
116 935
382 112
50 51
387 2698
104 477
823 345
2464 107
112 720
3897 383
1295 32
2278 2954
605 273
275 421
287 993
83 726
335 273
1971 391
311 2950
3393 1227
80 1003
4616 583
102 583
2469 962
502 561
2282 328
2716 1448
119 648
429 1672
67 354
110 354
273 633
290 552
3307 873
428 99
118 1000
116 665
301 462
335 510
2106 801
1662 268
2106 335
101 590
580 733
65 107
3919 2723
1642 119
77 289
301 469
108 801
752 116
790 102
433 491
459 116
121 590
2291 2724
375 628
327 273
2725 1030
293 316
315 70
2993 303
2481 491
115 790
301 291
1221 1457
56 53
478 114
406 2479
2117 676
287 1507
406 329
1770 643
301 913
71 101
562 335
652 2999
4672 2260
1113 270
4674 3000
4675 423
1550 45
2291 291
2108 303
346 876
835 2483
971 383
1496 477
1581 699
102 720
1567 328
263 1747
451 460
859 439
71 1978
1082 2121
69 478
101 398
108 417
77 775
3381 517
683 118
388 117
329 595
49 530
293 541
100 416
112 416
641 727
1827 32
3445 1194
109 383
273 107
79 99
2679 345
477 3450
103 108
743 99
2690 2265
2295 383
640 3932
1843 541
57 1680
301 112
670 468
395 1344
49 1028
467 2727
112 1031
530 1977
110 275
3966 2303
432 107
450 101
2280 292
2258 421
70 293
976 774
82 354
692 874
53 612
117 499
2113 397
1160 50
578 65
321 1395
454 283
1232 55
115 585
361 485
70 2275
370 1956
2274 691
1643 1195
3980 800
78 289
3982 328
65 116
78 68
1847 384
425 404
372 45
1566 792
518 3463
818 312
1157 472
4761 913
3016 3024
1751 424
4764 103
1059 975
292 2075
1183 290
683 109
106 3298
4770 1861
341 328
1641 265
112 370
292 263
901 56
1775 370
4777 938
68 101
105 1129
103 295
315 77
80 80
2657 100
4784 2650
2080 477
102 478
3028 2253
4005 2475
1108 358
1548 1828
330 262
781 49
732 3969
32 53
2761 1133
112 1082
4797 4013
4798 101
4799 117
4800 1832
694 51
433 457
2496 397
54 50
425 425
1674 313
50 1654
694 1085
2497 4017
311 262
462 100
1963 1638
742 98
3481 1155
2745 262
430 1751
510 424
111 285
3020 354
327 423
311 354
105 1859
781 52
37 834
49 760
2473 111
1079 109
517 374
313 265
2228 293
336 263
104 383
540 98
1305 507
290 816
4836 118
98 265
443 304
115 1030
551 1684
116 311
373 105
117 107
4033 2446
4845 3489
4846 304
102 372
437 2996
4849 4025
80 111
4023 491
107 3462
315 79
959 289
116 324
4856 111
495 108
425 32
707 3965
4048 1656
70 1507
4862 825
2766 481
4864 4049
259 145
2503 4053
1063 2315
4054 618
1462 2317
4870 392
168 269
413 594
394 1587
182 325
1308 1992
3058 294
654 461
1143 170
405 171
413 1592
165 1593
165 269
3060 359
3508 1996
420 1308
294 2771
660 134
10 1236
546 1595
978 569
570 170
863 378
923 306
754 906
3513 890
378 516
178 399
1162 584
1202 1875
4900 946
1237 593
309 1088
3520 744
700 355
413 294
182 2782
1469 427
277 888
1012 3521
542 412
982 1471
1998 463
864 32
618 2786
56 273
1360 166
394 2329
4918 715
480 1470
309 806
1702 863
463 576
400 486
309 181
45 609
378 464
420 1306
269 1599
378 570
906 172
1402 294
735 2767
1204 569
965 355
769 1704
1274 3533
523 294
320 3087
405 178
548 1602
264 412
181 3535
4108 1411
589 1043
135 3539
700 359
2141 2532
309 1357
156 4112
1403 306
489 3503
294 887
2337 4117
2526 306
134 331
1274 277
385 173
828 3545
3097 2803
1532 452
368 165
654 887
2321 4123
1163 281
155 3099
298 174
134 376
679 2005
700 318
410 4127
906 434
4131 264
170 1533
1401 819
492 3549
828 306
259 167
923 2157
926 852
4980 569
4981 3551
4982 2528
381 170
419 3085
32 781
655 410
533 1880
405 173
381 1088
841 574
2342 1353
4992 400
500 172
4081 3557
137 804
890 170
1694 2520
519 2810
890 360
264 269
1892 362
3558 277
400 574
1016 338
830 320
534 322
137 294
343 494
298 1118
176 616
891 2775
754 1038
4160 2342
609 272
5015 155
264 449
134 392
865 452
4163 419
947 1093
309 166
368 154
735 392
331 322
735 3572
557 1471
2350 298
3561 868
352 153
3083 3088
1116 419
5032 2524
171 656
655 400
2021 452
646 1464
4151 4169
436 152
5039 3081
1532 1165
368 2549
281 616
5043 533
338 355
4188 1038
318 1877
281 594
1269 618
259 159
1469 347
394 3127
1017 1169
355 594
294 1882
279 634
174 2166
359 520
137 715
5059 3082
594 4197
5061 463
271 2333
539 331
490 362
4115 945
783 1199
4200 1043
661 1093
264 618
542 1890
298 360
320 614
413 508
584 343
3133 2153
156 447
399 1267
309 176
557 2553
2821 1169
1095 174
1608 2564
1275 4220
3546 4088
853 1146
281 436
385 154
2022 755
2822 1802
2167 1878
2795 647
892 2549
281 1273
3093 3604
5095 520
1358 724
419 288
1605 4225
490 1402
4226 783
5101 2313
5102 366
1467 2527
3102 322
1277 322
1881 1696
782 3142
2028 863
175 3563
306 807
1468 965
2029 50
2830 4152
5114 1998
2353 908
2812 2026
841 3568
325 399
841 1999
318 3144
154 322
534 539
2535 306
492 508
419 1091
572 594
921 44
261 734
3619 351
2343 963
828 2000
1122 359
5133 3104
381 176
1479 1793
1170 46
1236 399
332 137
5139 1464
159 1609
5141 1403
694 54
2835 513
5144 1123
2836 512
966 453
282 4251
5148 444
2837 4253
5150 808
5151 1899
441 484
353 402
986 266
444 1720
1206 2172
2361 1421
988 786
349 622
1807 487
3629 729
133 1148
1900 389
673 3632
442 2173
393 532
2362 547
2032 1045
5169 1368
1173 3155
1423 172
282 746
348 880
402 446
364 348
278 151
3162 3639
667 474
156 348
2365 442
1019 179
442 1614
680 1325
365 1540
581 3159
154 1726
667 1123
364 532
4272 509
3650 2849
870 2579
3651 488
402 1809
466 151
610 389
134 653
431 151
5198 1211
882 1906
5200 1212
5201 1724
855 1616
4276 1537
5204 444
5205 344
133 446
550 3647
286 791
667 564
701 2041
349 881
136 2854
137 487
532 364
1809 278
5216 163
364 401
856 363
2838 1123
353 344
989 182
1124 2370
296 2847
870 133
466 181
3660 512
181 4285
487 505
484 756
603 2581
1427 2372
1126 1243
581 770
379 757
5235 2179
164 3176
364 1621
955 1418
2836 349
1279 3185
266 150
363 344
3667 4291
4292 364
353 364
466 176
441 348
730 2584
418 151
2039 4302
379 786
176 2871
1370 509
314 456
3191 1325
369 4307
379 444
929 389
1427 1420
296 1367
184 505
1415 4282
1046 1327
344 365
266 1620
441 513
46 257
170 365
5269 2377
1418 1173
314 1805
411 149
2842 1325
286 58
603 4311
3668 402
441 1369
505 622
2170 349
1175 348
266 832
1046 3683
393 4314
134 2867
2044 1719
363 474
1618 2376
870 159
730 363
1208 3684
401 353
3685 274
3682 2877
393 1725
45 257
314 161
178 1068
746 393
184 1904
5300 402
5301 757
353 274
174 348
737 1729
176 364
667 624
1902 2377
581 3197
4322 3196
756 379
344 389
544 850
600 337
560 1098
2605 560
195 141
5317 307
372 644
2465 350
265 638
796 435
3203 284
97 1431
358 106
712 591
1920 319
1288 847
438 2608
2385 1923
2884 615
506 587
968 1072
3708 1864
638 587
2199 1817
3712 787
2885 32
315 2200
2112 304
4356 1486
625 373
957 1628
414 536
958 438
824 1929
4362 265
2279 293
384 938
396 2886
479 4364
373 462
4014 432
3717 32
311 2052
560 438
3218 4370
5357 1931
337 1002
2384 319
414 1074
1855 284
1373 317
2616 262
968 1051
3220 105
98 970
5367 3221
115 3724
116 2703
46 91
5371 305
5372 4375
5373 398
5374 275
5375 604
5376 97
1081 317
3009 1054
1566 992
2049 445
3227 4379
438 1542
1194 957
4382 310
727 319
4384 319
1732 319
195 129
611 330
100 1568
310 471
1582 668
3229 46
541 317
3894 658
3230 1187
2397 108
122 565
2893 265
1260 265
315 337
270 1668
1634 1632
1185 336
68 346
1822 304
297 455
105 275
336 1783
1970 2623
705 317
2624 3225
380 525
4018 336
495 535
109 336
5417 595
809 525
106 1222
1150 319
504 310
388 4020
86 73
462 2762
295 455
398 380
327 388
312 336
287 536
681 496
301 1676
386 301
5433 304
403 2398
108 2687
2197 310
301 3742
111 118
3234 3834
84 912
2632 2633
304 695
438 54
273 428
973 312
428 3741
1026 408
97 1099
1572 3388
284 1178
100 4413
337 1300
2214 2051
5454 305
876 1739
3728 122
2616 313
555 468
2747 2076
302 1084
3762 2461
638 455
659 386
5464 99
5465 596
1261 1097
1245 403
99 3048
1258 2223
1103 110
973 101
372 304
3706 380
432 1227
813 450
329 312
465 302
675 1760
2636 310
565 403
284 631
3036 2394
722 713
1737 1929
3250 455
604 1457
2626 1486
766 443
71 117
1219 4440
780 319
1305 1048
1440 747
110 1050
327 111
3260 284
2624 1625
2214 4448
1738 265
3781 265
1158 536
3990 3261
606 357
3264 32
1937 739
1397 275
506 1821
535 631
337 1024
787 1941
5511 330
4457 284
3212 319
408 3784
372 1624
1151 295
1440 1050
499 3254
1029 621
5520 117
80 3790
5522 445
3032 565
1521 4444
372 301
3485 112
68 275
4360 3761
1643 287
2916 3219
3471 1032
644 317
2734 263
681 764
388 620
1741 631
560 4398
620 1052
97 396
4462 3791
380 938
2239 337
3269 398
1938 3252
2916 1112
2059 304
5547 1826
3488 3215
5549 471
97 499
116 448
468 1032
3253 319
1022 313
39 39
1098 1489
40 1517
4428 511
713 284
387 975
5561 105
111 606
2413 3793
5564 4473
4475 345
285 2650
1375 959
5568 1249
626 3271
2415 1549
1639 771
4477 105
5573 4478
66 1181
5575 345
98 1183
1641 423
1642 112
116 357
3273 336
3279 2228
2229 357
3803 460
697 874
4480 682
5586 273
3807 657
1376 4482
3809 111
1496 4485
472 437
304 104
595 116
626 1746
57 44
2926 759
4491 3286
5598 2417
5599 115
97 639
1333 375
1251 1218
2419 778
1156 578
4500 374
3292 671
289 472
289 491
103 1184
2659 2665
5611 1503
1439 117
1221 2421
510 896
3299 4508
3300 1222
77 604
5618 2667
749 773
3821 873
712 896
4512 299
712 32
340 1746
289 422
114 357
2428 397
83 3828
3830 328
1250 439
3310 4515
5632 4516
3311 265
108 478
510 273
106 861
2074 2669
3835 324
544 465
5640 2432
5641 110
1441 262
387 710
334 115
450 1561
4528 311
537 1506
1383 1549
2943 1563
750 3838
3326 371
1136 605
292 440
342 345
538 115
426 1337
1502 1653
5658 328
562 346
824 595
812 1958
3331 644
2683 328
1754 2947
5665 265
2085 54
3841 2253
530 395
651 561
578 1337
414 465
691 345
1656 398
5674 3846
462 307
3337 313
1153 105
511 437
4545 2950
103 640
2257 1385
5682 1296
3340 556
4546 1841
5685 465
468 111
3851 100
1552 644
3852 3342
2258 4550
1132 2260
265 301
121 45
718 1492
4552 915
206 189
5697 206
5698 180
310 40
450 97
3348 357
2236 32
83 566
875 111
203 136
203 144
1155 336
110 1078
423 751
1567 759
3355 439
845 334
3861 1388
340 628
72 445
1549 345
114 329
100 335
108 1656
299 335
301 1515
1517 1130
370 107
2962 302
759 374
101 4567
101 104
66 311
299 273
112 334
102 538
72 289
423 68
97 1343
4577 3363
291 324
4507 2095
99 114
116 3367
3869 3368
788 121
1300 1181
2454 32
2971 823
1947 1152
685 477
432 2972
2960 108
313 553
106 111
976 301
562 1563
683 429
100 387
384 454
555 273
732 397
840 778
2705 3375
3376 135
1508 710
116 725
118 2459
3287 303
285 1668
469 3375
759 340
285 1962
2276 107
733 740
2460 374
65 697
5773 1765
1084 1835
2445 273
467 2977
2443 32
374 751
327 899
3340 330
825 384
641 426
1946 303
1341 105
5785 3389
120 32
1295 1438
1302 111
1027 1224
1031 4609
3898 102
971 275
115 305
4611 3387
101 311
275 304
795 437
75 3394
406 1972
712 273
103 514
429 596
424 1851
97 791
77 1852
551 1190
1378 1338
99 457
119 1181
3399 814
426 3822
481 341
511 346
468 103
2283 562
112 1853
2947 328
263 304
652 462
3400 121
1141 275
299 2434
1222 102
1492 561
76 97
112 290
3806 969
115 3402
5829 2973
263 1333
4629 357
104 293
2105 397
3303 639
106 367
108 2071
115 426
111 283
115 583
334 375
1302 478
454 115
115 99
110 839
4639 1249
792 340
720 100
99 1078
790 528
98 311
1296 2475
604 1844
103 32
1831 305
301 2414
5856 117
432 262
517 973
5859 845
374 812
2988 2722
1137 846
327 465
4644 103
3412 2724
2110 328
97 537
2949 361
5869 491
1182 395
900 970
3893 648
1676 262
675 117
5875 3849
693 514
2292 295
826 514
104 4588
1188 52
76 4655
536 421
336 115
1027 720
116 1773
2294 1080
1665 876
1650 697
849 311
659 527
3930 316
1188 4662
102 354
290 611
2728 328
321 299
4569 2709
540 1138
469 45
108 741
404 2296
313 626
1221 2712
2717 283
426 812
1060 612
1637 330
3429 417
74 354
5910 551
3847 114
4670 2277
98 424
900 862
115 313
55 612
3433 835
765 974
69 4680
115 370
846 1754
108 722
1581 388
84 105
107 287
3432 752
536 384
1947 3948
3904 313
774 303
1152 3910
5932 370
114 726
119 823
4688 1582
3946 599
115 1660
3949 397
102 460
4690 289
114 723
74 4691
109 388
2733 99
102 837
586 845
292 262
4694 773
54 56
642 103
4696 668
5952 443
3440 374
5954 2416
75 3441
312 263
585 772
3443 53
2465 4699
5960 1057
5961 40
1028 422
5963 940
2294 914
1349 51
727 3954
82 299
697 289
791 67
491 2739
1581 304
118 1134
2479 4707
270 263
358 592
74 396
100 114
4713 4714
997 345
665 265
1843 313
3451 2257
49 1982
1226 70
345 561
263 626
3438 2734
46 51
764 772
725 32
387 103
346 105
118 437
939 527
4719 2723
118 424
2745 335
287 334
649 1382
6000 110
99 382
1189 685
1264 387
2984 838
1056 648
404 51
327 100
2302 641
2991 504
596 2125
2967 303
3459 80
6013 1185
74 2071
6015 97
6016 1082
6017 108
6018 328
333 1112
104 262
303 4738
450 641
6023 337
4741 2754
1160 55
555 2696
76 105
1232 1778
2755 304
301 658
2289 1985
6032 32
273 2476
86 315
901 1862
382 1141
4749 1973
2422 3378
901 54
771 2749
3978 792
2493 263
6043 2113
101 774
2302 104
2987 335
901 57
3017 1744
3325 1223
1257 2492
3984 1521
416 3342
4755 32
10 502
1566 648
6056 3020
6057 1195
6058 491
6059 1752
3987 342
302 313
404 52
649 1108
3021 330
3022 556
555 102
1579 2982
101 651
346 262
2306 104
416 861
2087 105
4763 335
541 371
1584 527
1681 367
108 313
285 1660
1864 342
67 3353
305 283
3023 327
102 2267
6084 284
765 4768
3421 428
2274 384
391 4769
1980 421
99 388
1579 605
117 450
84 275
3026 273
2101 621
6096 291
335 293
998 329
78 1651
2730 3999
83 111
6102 454
1748 4774
1683 4543
1232 52
1005 2940
78 1111
84 301
6109 335
1029 1108
6111 621
100 707
67 437
4004 330
2478 4781
69 4667
1977 303
694 48
2242 372
110 676
626 1436
388 397
2277 330
3475 32
1956 345
443 2712
798 372
694 55
1304 53
4009 1828
2078 640
1386 313
56 612
781 57
3935 295
49 1517
46 52
2946 526
226 130
6140 185
46 57
335 116
103 304
543 101
1344 1338
56 44
301 4760
301 684
50 56
781 760
53 52
683 454
1754 1349
6154 1130
2099 285
115 467
114 417
102 373
694 3012
336 112
3027 357
1305 1448
2482 1638
112 32
3297 838
76 299
6167 1077
101 34
4817 105
105 940
643 328
98 341
541 2269
2473 4818
6175 334
862 273
387 273
722 4822
121 423
107 299
1248 370
6182 495
115 727
2662 273
1958 345
327 1648
1518 3902
102 301
2298 116
530 553
80 437
83 299
78 105
4021 265
109 337
1060 49
49 50
4827 437
80 387
850 749
6201 3441
87 72
6203 79
2760 311
388 262
1459 1745
1254 341
3018 2086
388 727
2294 111
6211 814
1756 371
682 114
529 287
3037 387
859 109
465 295
4024 328
2073 780
1058 2711
659 299
3886 648
75 289
111 317
606 292
2988 361
675 1657
6228 2423
112 457
100 1181
67 311
1770 1833
6233 1768
2309 1856
305 1560
110 1036
443 295
1296 103
102 396
545 297
290 900
6242 117
3477 373
1667 330
2764 1565
528 621
659 1054
104 752
3490 327
6250 336
4848 1985
3039 473
387 495
66 4850
115 3983
107 346
450 346
